# Операции (+,-,*,/,//(целочисельное деления),**,%)
# Пример : 11//5=2; 37//11=3...

# Пример:  15%3=0,(остаток при деление), 16%3=1...

# Приоритеты у (),**...

# Встроенние:
# abs()- находить модуль числа - abs(-7) result 7...
# max(x1,x2,x3...) дает самий большой
# min() работает также
# pow(x1,x2) возводит x1 в степень x2
# round() округляет по правилам математики по сотим в конце писать ,2
#
#

print(pow(2,2))
print(round(456,-1))
print(round(456,-2))

# нахождение корня 9**0,5 или 1/2

print()
print(81**0.5)