
                                   # ТИП ДАННЫХ СЕТ


# тип данных set(множество) основное отличие неупорядочность  и нет дубликатов тоесть не по порядку а по рандому
#a = {1,2,3,4,5,6,1,2,3,4,5,6}
# b = {'hi','ha','ho','hi','ha'}

# c  = set('abracadabra') - разобьет букви через коми по рандому и дубликатов
# d = set([1,2,3,4,5,6,1,2,3,4,5,6])
# e = set(range(5))
# f = {}


a = {120, 30, 20, 15}

# добавляет  a.add(9)
#  обновляет также можно таким способом добавлять несколько елементов  a.update([5,6,7])
#  a.update('hello')
# a.update(range(1,2))

# удаление a.discard(120)
# удаление (и если нет обьект-а такого вибьет ошибку) a.remove(120)
# pop тоже удаляет
# clear все очищает

# проверить есть ли что-то в множестве print(120 in a, 7 in a, 7 not in a)

# print (a | b) обьединяет множества или print  a = a.union(b) или a |= b

# можно сравнивать print(a==b) или print(a>b) ,  (a<b)

# также можно обходить по циклу фор по i(значению)

# (a & b) - пересечение елементов в сете(больше двух) или interseaction()

# вычитания множеств(вычитает те которые пересикаються из другого множества) (a-b) или (b-a)

#





